Bengreen/ide-hardware/arm/boards.txt
tkpico.name=Tinker Pico

tkpico.build.board=TINKER_PICO
tkpico.build.variant=jeelabs_tkp
tkpico.build.core=lpc8xx
tkpico.build.mcu=cortex-m0plus
tkpico.build.f_cpu=12000000L
tkpico.build.extra_flags=-mthumb -march=armv6-m -D__LPC8__ 
tkpico.build.ldscript=ld/flash.ld

tkpico.upload.tool=uploader
tkpico.upload.file_type=bin
tkpico.upload.maximum_size=32768
tkpico.upload.flash.maximum_size=32768
tkpico.upload.ram.maximum_size=8192
tkpico.upload.protocol=lpc8_usart
tkpico.upload.auto_reset=true
